101/sysv/red-hat_runlevels.org
#+title: Red Hat (centOS) with SysVinit
#+author: Gabriel

Em distros Red Hat/ CEntoOS os serviços ficam em /etc/rc.d/init.d, todos os arquivos possuem um hard link para /etc/init.d. Então tanto faz mudar em um como em outro, ambos serão atualizados

Cabeçalho de inicialização do sshd no CEntoOS ->

#+begin_src text
# head -n 15 /etc/rc.d/init.d/sshd
# !/ bin / bash
#
# Init file for OpenSSH server daemon
#
# chkconfig : 2345 55 25
# description : OpenSSH server daemon
#
# processname : sshd
# config : /etc/ssh/ssh_host_key
# config : /etc/ssh/ssh_host_key.pub
# config : /etc/ssh/ssh_random_seed
# config : /etc/ssh/sshd_config
# pidfile : /var/run/sshd.pid
#+end_src

*chkconfig*: <Níveis de execução para inicialização> <Ordem de inicialização "S"> <Ordem de parada "K">

*Description*: Descrição

*config* Arquivos de configuração

*pidfile* Localização do PID do process

** Gerenciando os serviços com ~chkconfig~

Verificar serviços habilitados em cada runlevel ->
#+begin_src sh
chkconfig --list
#+end_src

Para serviço específico ->
#+begin_src sh
chkconfig --list httpd
#+end_src

Adicionar serviço ssh na inicialização ->
#+begin_src sh
chkconfig --add sshd

ou

chkconfig sshd on
#+end_src

Desabilitar serviço sshd na inicialização ->
#+begin_src sh
chkconfig --del sshd

ou

chkconfig sshd off
#+end_src

Para habilitar o serviço em determinados níveis ->
#+begin_src sh
chkconfig --level 23 sshd on
#+end_src

Para desabilitar o serviço ssh em determinados níveis ->
#+begin_src sh
chkconfig --level 2 sshd off
#+end_src

Para iniciar um serviço ->
#+begin_src sh
service sshd start
#+end_src

Para parar um serviço ->
#+begin_src sh
service sshd stop
#+end_src
